In [1]:
import numpy as np
import pandas as pd

In [2]:
x=['a','b','c','d','e']
x2=['a','b','c','d','e']
y=[1,2,3,4,5]
z={1:'a',2:'b',3:'c',4:'d',5:'e'}

In [3]:
pd.Series(data=x)

0    a
1    b
2    c
3    d
4    e
dtype: object

In [4]:
b=pd.Series(data=x,index=y)
b

1    a
2    b
3    c
4    d
5    e
dtype: object

In [5]:
c=pd.Series(x,y)
c

1    a
2    b
3    c
4    d
5    e
dtype: object

In [6]:
f=pd.Series(y,x2)
f

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
f['c'] #seach with index

3

In [8]:
f['c':'e']

c    3
d    4
e    5
dtype: int64

# data frame

In [9]:
A=[1,2,3,4]
B=[5,6,7,8]
C=[9,0,1,2]
D=[3,4,5,6]
E=[7,8,9,0]

In [10]:
#pd.DataFrame([data which u have to add],["rows name"],["col name"])
df=pd.DataFrame([A,B,C,D,E],['a','b','c','d','e'],['w','x','y','z'])
df

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6
e  7  8  9  0

In [11]:
#add a column 
df['p']=df['y']+df['z']
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11
e  7  8  9  0   9

In [12]:
#delete a row 
#drop not remove row permanent 
df.drop('e')

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [13]:
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11
e  7  8  9  0   9

In [14]:
#inplace help to delete row permently
df.drop('e',inplace=True)
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [15]:
#drop column in column use axis 1
df.drop('p',axis=1)
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [16]:
df

   w  x  y  z   p
a  1  2  3  4   7
b  5  6  7  8  15
c  9  0  1  2   3
d  3  4  5  6  11

In [17]:
df.drop('p',axis=1,inplace=True)
df

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

In [18]:
df

   w  x  y  z
a  1  2  3  4
b  5  6  7  8
c  9  0  1  2
d  3  4  5  6

In [19]:
#acessing column
df['y']

a    3
b    7
c    1
d    5
Name: y, dtype: int64

In [20]:
#acessing a row
df.loc['a']

w    1
x    2
y    3
z    4
Name: a, dtype: int64

In [21]:
#acessing a row
df.iloc[1]

w    5
x    6
y    7
z    8
Name: b, dtype: int64

In [22]:
df.loc['d','y']

5

In [23]:
#conditional accessing
df>3

       w      x      y      z
a  False  False  False   True
b   True   True   True   True
c   True  False  False  False
d  False   True   True   True

In [24]:
df[df>3]

     w    x    y    z
a  NaN  NaN  NaN  4.0
b  5.0  6.0  7.0  8.0
c  9.0  NaN  NaN  NaN
d  NaN  4.0  5.0  6.0

In [25]:
df[df['w']>3]

   w  x  y  z
b  5  6  7  8
c  9  0  1  2

In [26]:
df[df['w']>3]['w']

b    5
c    9
Name: w, dtype: int64

In [27]:
df[(df['w']>3) & (df['z']>2)]

   w  x  y  z
b  5  6  7  8

In [28]:
d={'a':[1,2,3,4,5],'b':[6,7,8,9,np.nan],'c':[0,1,2,np.nan,np.nan],'d':[3,4,np.nan,np.nan,np.nan],'e':[5,np.nan,np.nan,np.nan,np.nan]}

In [29]:
d

{'a': [1, 2, 3, 4, 5],
 'b': [6, 7, 8, 9, nan],
 'c': [0, 1, 2, nan, nan],
 'd': [3, 4, nan, nan, nan],
 'e': [5, nan, nan, nan, nan]}

In [30]:
df=pd.DataFrame(d)
df

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [31]:
df.dropna(axis=0)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0

In [32]:
df.dropna(axis=1)

   a
0  1
1  2
2  3
3  4
4  5

In [33]:
#thresh gives u the result where given no of value is present
df.dropna(thresh=5)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0

In [34]:
df.dropna(thresh=3)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN

In [35]:
df.fillna(0)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  0.0
2  3  8.0  2.0  0.0  0.0
3  4  9.0  0.0  0.0  0.0
4  5  0.0  0.0  0.0  0.0

In [36]:
#fill column with mean value

df['b'].fillna(value=df['b'].mean())

0    6.0
1    7.0
2    8.0
3    9.0
4    7.5
Name: b, dtype: float64

In [37]:
df['c'].fillna(value=df['c'].mean())

0    0.0
1    1.0
2    2.0
3    1.0
4    1.0
Name: c, dtype: float64

In [38]:
df['d'].fillna(value=df['d'].mean())

0    3.0
1    4.0
2    3.5
3    3.5
4    3.5
Name: d, dtype: float64

In [39]:
df['e'].fillna(value=df['e'].mean())

0    5.0
1    5.0
2    5.0
3    5.0
4    5.0
Name: e, dtype: float64

In [40]:
#null value find in every row
nul=df.isnull().sum()
nul

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [41]:
#total no of null value in dataframe
nul.sum()

10

In [42]:
#shortcut for count null value in datafreane
nul_total=(df.isnull().sum()).sum()
nul_total

10

In [43]:
nulll=df.isnull()
nulll

       a      b      c      d      e
0  False  False  False  False  False
1  False  False  False  False   True
2  False  False  False   True   True
3  False  False   True   True   True
4  False   True   True   True   True

In [44]:
#null values in 
na=df.isnull().value_counts()
na

a      b      c      d      e
False  True   True   True   True     1
       False  True   True   True     1
              False  True   True     1
                     False  True     1
                            False    1
dtype: int64

In [45]:
p={'item':['apple','apple','orange','orange','guns','guns'],'days':['mon','tue','wed','thu','fri','sat'],'sales':[100,80,200,100,5,10]}
p

{'item': ['apple', 'apple', 'orange', 'orange', 'guns', 'guns'],
 'days': ['mon', 'tue', 'wed', 'thu', 'fri', 'sat'],
 'sales': [100, 80, 200, 100, 5, 10]}

In [46]:
df=pd.DataFrame(p)
df

     item days  sales
0   apple  mon    100
1   apple  tue     80
2  orange  wed    200
3  orange  thu    100
4    guns  fri      5
5    guns  sat     10

In [47]:
#group by
x=df.groupby('item')
x

In [48]:
x.mean()

        sales
item
apple    90.0
guns      7.5
orange  150.0

In [49]:
x.std()

            sales
item
apple   14.142136
guns     3.535534
orange  70.710678

In [50]:
x.count()

        days  sales
item
apple      2      2
guns       2      2
orange     2      2

In [51]:
x.max()

       days  sales
item
apple   tue    100
guns    sat     10
orange  wed    200

In [52]:
x.min()

       days  sales
item
apple   mon     80
guns    fri      5
orange  thu    100

In [53]:
x.describe()

       sales
       count   mean        std    min     25%    50%     75%    max
item
apple    2.0   90.0  14.142136   80.0   85.00   90.0   95.00  100.0
guns     2.0    7.5   3.535534    5.0    6.25    7.5    8.75   10.0
orange   2.0  150.0  70.710678  100.0  125.00  150.0  175.00  200.0

In [54]:
x.describe().transpose()

item              apple       guns      orange
sales count    2.000000   2.000000    2.000000
      mean    90.000000   7.500000  150.000000
      std     14.142136   3.535534   70.710678
      min     80.000000   5.000000  100.000000
      25%     85.000000   6.250000  125.000000
      50%     90.000000   7.500000  150.000000
      75%     95.000000   8.750000  175.000000
      max    100.000000  10.000000  200.000000

In [55]:
#joining

x1={'a':[1,2,3],'b':[5,6,7]}
y1={'c':[3,4,5],'d':[2,3,4]}

In [56]:
x=pd.DataFrame(x1,index=['p1','p2','p3'])
y=pd.DataFrame(y1,index=['p1','p4','p3'])
x

    a  b
p1  1  5
p2  2  6
p3  3  7

In [57]:
y

    c  d
p1  3  2
p4  4  3
p3  5  4

In [58]:
x.join(y)

    a  b    c    d
p1  1  5  3.0  2.0
p2  2  6  NaN  NaN
p3  3  7  5.0  4.0

In [59]:
x.join(y, how="left")

    a  b    c    d
p1  1  5  3.0  2.0
p2  2  6  NaN  NaN
p3  3  7  5.0  4.0

In [60]:
x.join(y, how="right")

      a    b  c  d
p1  1.0  5.0  3  2
p4  NaN  NaN  4  3
p3  3.0  7.0  5  4

In [61]:
x.join(y, how="inner")

    a  b  c  d
p1  1  5  3  2
p3  3  7  5  4

In [62]:
x.join(y, how="outer")

      a    b    c    d
p1  1.0  5.0  3.0  2.0
p2  2.0  6.0  NaN  NaN
p3  3.0  7.0  5.0  4.0
p4  NaN  NaN  4.0  3.0

In [63]:
#combine or concat
x1={'a':[1,1,1,1,1],'b':[1,1,1,1,1],'c':[1,1,1,1,1],'d':[1,1,1,1,1],'e':[1,1,1,1,1] }
x2={'e':[2,2,2,2,2],'f':[2,2,2,2,2],'g':[2,2,2,2,2],'h':[2,2,2,2,2],'i':[2,2,2,2,2] }
x3={'a':[3,3,3,3,3],'b':[3,3,3,3,3],'c':[3,3,3,3,3],'d':[3,3,3,3,3],'e':[3,3,3,3,3] }

In [64]:
df1=pd.DataFrame(x1,index=[1,2,3,4,5])
df2=pd.DataFrame(x2,index=[1,2,3,4,5])
df3=pd.DataFrame(x3,index=[5,6,7,8,9])

In [65]:
df1

   a  b  c  d  e
1  1  1  1  1  1
2  1  1  1  1  1
3  1  1  1  1  1
4  1  1  1  1  1
5  1  1  1  1  1

In [66]:
df2

   e  f  g  h  i
1  2  2  2  2  2
2  2  2  2  2  2
3  2  2  2  2  2
4  2  2  2  2  2
5  2  2  2  2  2

In [67]:
df3

   a  b  c  d  e
5  3  3  3  3  3
6  3  3  3  3  3
7  3  3  3  3  3
8  3  3  3  3  3
9  3  3  3  3  3

In [68]:
pd.concat([df1,df2])

     a    b    c    d  e    f    g    h    i
1  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
3  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
4  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
5  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
2  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
3  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
4  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
5  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0

In [69]:
pd.concat([df1,df3],axis=0) #2 e is here

   a  b  c  d  e
1  1  1  1  1  1
2  1  1  1  1  1
3  1  1  1  1  1
4  1  1  1  1  1
5  1  1  1  1  1
5  3  3  3  3  3
6  3  3  3  3  3
7  3  3  3  3  3
8  3  3  3  3  3
9  3  3  3  3  3

In [70]:
pd.concat([df1,df3],axis=1)

     a    b    c    d    e    a    b    c    d    e
1  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
3  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
4  1.0  1.0  1.0  1.0  1.0  NaN  NaN  NaN  NaN  NaN
5  1.0  1.0  1.0  1.0  1.0  3.0  3.0  3.0  3.0  3.0
6  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
7  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
8  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
9  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0

In [71]:
pd.concat([df1,df2,df3],axis=0)

     a    b    c    d  e    f    g    h    i
1  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
3  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
4  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
5  1.0  1.0  1.0  1.0  1  NaN  NaN  NaN  NaN
1  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
2  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
3  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
4  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
5  NaN  NaN  NaN  NaN  2  2.0  2.0  2.0  2.0
5  3.0  3.0  3.0  3.0  3  NaN  NaN  NaN  NaN
6  3.0  3.0  3.0  3.0  3  NaN  NaN  NaN  NaN
7  3.0  3.0  3.0  3.0  3  NaN  NaN  NaN  NaN
8  3.0  3.0  3.0  3.0  3  NaN  NaN  NaN  NaN
9  3.0  3.0  3.0  3.0  3  NaN  NaN  NaN  NaN

In [72]:
pd.concat([df1,df2,df3],axis=1)

     a    b    c    d    e    e    f    g    h    i    a    b    c    d    e
1  1.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0  2.0  NaN  NaN  NaN  NaN  NaN
2  1.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0  2.0  NaN  NaN  NaN  NaN  NaN
3  1.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0  2.0  NaN  NaN  NaN  NaN  NaN
4  1.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0  2.0  NaN  NaN  NaN  NaN  NaN
5  1.0  1.0  1.0  1.0  1.0  2.0  2.0  2.0  2.0  2.0  3.0  3.0  3.0  3.0  3.0
6  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
7  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
8  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0
9  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  3.0  3.0  3.0  3.0  3.0

In [73]:
#merging
df1=pd.DataFrame({'key1':[1,2,3],'a':[2,3,4],'b':[5,6,7]})
df2=pd.DataFrame({'key1':[1,2,3],'c':[1,2,9],'d':[5,8,9]})

In [74]:
df1

   key1  a  b
0     1  2  5
1     2  3  6
2     3  4  7

In [75]:
df2

   key1  c  d
0     1  1  5
1     2  2  8
2     3  9  9

In [76]:
pd.merge(df1,df2)

   key1  a  b  c  d
0     1  2  5  1  5
1     2  3  6  2  8
2     3  4  7  9  9

In [77]:
pd.merge(df1,df2,on='key1',how='inner')

   key1  a  b  c  d
0     1  2  5  1  5
1     2  3  6  2  8
2     3  4  7  9  9

In [78]:
#importent methods

x=pd.DataFrame({'a':[1,2,3,4,5],'b':[20,50,90,40,50]})
x

   a   b
0  1  20
1  2  50
2  3  90
3  4  40
4  5  50

In [79]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [80]:
x.columns

Index(['a', 'b'], dtype='object')

In [81]:
x['b'].sum()

250

In [82]:
def inc(x):
    x=x+100
    return x

In [83]:
x['b'].apply(inc)

0    120
1    150
2    190
3    140
4    150
Name: b, dtype: int64

In [84]:
x.sort_values('b')

   a   b
0  1  20
3  4  40
1  2  50
4  5  50
2  3  90

In [85]:
#show the unique value skip repeted value
x['b'].unique()

array([20, 50, 90, 40], dtype=int64)

In [86]:
#showes the unique value no
x['b'].nunique()

4

In [87]:
x.value_counts()

a  b
5  50    1
4  40    1
3  90    1
2  50    1
1  20    1
dtype: int64

In [88]:
x=pd.DataFrame({'a':[np.nan,2,3,4,5],'b':[20,50,np.nan,40,50],'c':[np.nan,2,3,4,np.nan],})
x

     a     b    c
0  NaN  20.0  NaN
1  2.0  50.0  2.0
2  3.0   NaN  3.0
3  4.0  40.0  4.0
4  5.0  50.0  NaN

In [89]:
x.isnull()

       a      b      c
0   True  False   True
1  False  False  False
2  False   True  False
3  False  False  False
4  False  False   True

In [90]:
p=x.isnull().sum()
p

a    1
b    1
c    2
dtype: int64

In [91]:
p.sum()

4